BUILD=build
ISO=نظام_العرب.iso
النواه=النواه.elf
ISO_DIR=iso
BACKGROUND=default.png

CFLAGS= -m64 -mno-red-zone -mcmodel=small \
-ffreestanding -fno-stack-protector -fno-pie -fno-pic \
-Wall -Wextra -Wno-unused-function \
-Iالنواه \
-Iالنواه/محرك_انظمة_الملفات \
-Iالنواه/محرك_التعريفات \
-Iالنواه/محرك_التنفيذ \
-Iالنواه/محرك_الفيديو \
-Iالنواه/التعريفات_الاساسية \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/المجلدات \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/المسارات \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/القراءة \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/الكتابة \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/التهيئة \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/العقدة \
-Iالنواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/الكتلة

LDFLAGS=-m elf_x86_64 -T ربط_الملفات.ld

all: $(ISO)

$(ISO): $(النواه)
	mkdir -p $(ISO_DIR)/boot/grub
	mkdir -p $(ISO_DIR)/أرض_المستخدم/boot
	mkdir -p $(ISO_DIR)/boot/الخطوط

	mkdir -p $(ISO_DIR)/المثبت
	mkdir -p $(ISO_DIR)/أرض_المستخدم/النظام/النواه

	cp boot/grub/grub.cfg $(ISO_DIR)/boot/grub/
	cp boot/$(BACKGROUND) $(ISO_DIR)/boot/

	# نسخ الخط
	cp boot/الخطوط/الخط.pf2 $(ISO_DIR)/boot/الخطوط/

	# نسخ النواة إلى boot الخاص بالـ ISO
	cp boot/$(النواه) $(ISO_DIR)/boot/
	# نسخ النواة داخل النظام المضغوط
	cp boot/$(النواه) $(ISO_DIR)/أرض_المستخدم/boot/

	# نسخ باقي أرض المستخدم
	cp -r أرض_المستخدم/* $(ISO_DIR)/أرض_المستخدم/
	# نسخ المثبت
	cp -r المثبت/* $(ISO_DIR)/المثبت/

	grub-mkrescue -o $(ISO) $(ISO_DIR)

$(النواه):
	mkdir -p $(BUILD)

	# Boot — elf64 بدلاً من elf32
	nasm -f elf64 boot/multiboot.asm -o $(BUILD)/multiboot.o

	# Core
	gcc $(CFLAGS) -c النواه/النواه.c -o $(BUILD)/النواه.o
	gcc $(CFLAGS) -c النواه/القلب/الجوهرة.c -o $(BUILD)/الجوهرة.o

	# Drivers Manager
	gcc $(CFLAGS) -c النواه/محرك_التعريفات/محرك_التعريفات.c -o $(BUILD)/محرك_التعريفات.o
	# محرك_النصوص
	gcc $(CFLAGS) -c النواه/محرك_النصوص/string.c -o $(BUILD)/string.o

	# Keyboard
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/لوحات_المفاتيح/لوحة_المفاتيح_الافتراضية/لوحة_المفاتيح_الافتراضية.c -o $(BUILD)/لوحة_المفاتيح_الافتراضية.o

	# VGA
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/الشاشة/شاشة_VGA_النصية/شاشة_VGA_النصية.c -o $(BUILD)/شاشة_VGA_النصية.o

	# ATA
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/التخزين/ATA/ata.c -o $(BUILD)/ata.o

	# Execution
	gcc $(CFLAGS) -c النواه/محرك_التنفيذ/محرك_التنفيذ.c -o $(BUILD)/محرك_التنفيذ.o

	# محرك_الذاكرة
	gcc $(CFLAGS) -c النواه/محرك_الذاكرة/محرك_الذاكرة.c -o $(BUILD)/محرك_الذاكرة.o

	# محرك_العمليات
	gcc $(CFLAGS) -c النواه/محرك_العمليات/محرك_العمليات.c -o $(BUILD)/محرك_العمليات.o

	# محرك_الجدولة
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/محرك_الجدولة.c -o $(BUILD)/محرك_الجدولة.o

	# File System Engine
	gcc $(CFLAGS) -c النواه/محرك_انظمة_الملفات/محرك_انظمة_الملفات.c -o $(BUILD)/محرك_انظمة_الملفات.o

	# ArabFS
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/نظام_العرب.c -o $(BUILD)/نظام_العرب.o

	# Directories
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/المجلدات/المجلدات.c -o $(BUILD)/المجلدات.o

	# Paths
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/المسارات/المسارات.c -o $(BUILD)/المسارات.o

	# Read
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/القراءة/القراءة.c -o $(BUILD)/القراءة.o

	# Write
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/الكتابة/الكتابة.c -o $(BUILD)/الكتابة.o

	# الملفات
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/الملفات/الملفات.c -o $(BUILD)/الملفات.o

	# Init
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/التهيئة/التهيئة.c -o $(BUILD)/التهيئة.o

	# Inode
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/العقدة/العقدة.c -o $(BUILD)/العقدة.o

	# Block
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/الكتلة/الكتلة.c -o $(BUILD)/الكتلة.o

	# عام
	gcc $(CFLAGS) -c النواه/التعريفات_الاساسية/أنظمة_الملفات/نظام_العرب/التعريف_العام/التعريف_العام.c -o $(BUILD)/التعريف_العام.o

	# Video
	gcc $(CFLAGS) -c النواه/محرك_الفيديو/محرك_الفيديو.c -o $(BUILD)/محرك_الفيديو.o
	gcc $(CFLAGS) -c النواه/محرك_الفيديو/عارض_الصورة.c -o $(BUILD)/عارض_الصورة.o
	gcc $(CFLAGS) -c النواه/محرك_الفيديو/الخط.c -o $(BUILD)/الخط.o

	# UI
	gcc $(CFLAGS) -c أرض_المستخدم/الواجهة/الطرفية.c -o $(BUILD)/الطرفية.o

	# Link — elf_x86_64 بدلاً من elf_i386
	ld $(LDFLAGS) -o boot/$(النواه) \
	$(BUILD)/multiboot.o \
	$(BUILD)/النواه.o \
	$(BUILD)/الجوهرة.o \
	$(BUILD)/string.o \
	$(BUILD)/محرك_التعريفات.o \
	$(BUILD)/لوحة_المفاتيح_الافتراضية.o \
	$(BUILD)/شاشة_VGA_النصية.o \
	$(BUILD)/ata.o \
	$(BUILD)/محرك_التنفيذ.o \
	$(BUILD)/محرك_انظمة_الملفات.o \
	$(BUILD)/محرك_الذاكرة.o \
	$(BUILD)/محرك_العمليات.o \
	$(BUILD)/محرك_الجدولة.o \
	$(BUILD)/نظام_العرب.o \
	$(BUILD)/المجلدات.o \
	$(BUILD)/المسارات.o \
	$(BUILD)/القراءة.o \
	$(BUILD)/الكتابة.o \
	$(BUILD)/التهيئة.o \
	$(BUILD)/العقدة.o \
	$(BUILD)/الكتلة.o \
	$(BUILD)/الملفات.o \
	$(BUILD)/التعريف_العام.o \
	$(BUILD)/محرك_الفيديو.o \
	$(BUILD)/عارض_الصورة.o \
	$(BUILD)/الخط.o \
	$(BUILD)/الطرفية.o

# qemu-system-x86_64 بدلاً من qemu-system-i386
run: all
	qemu-system-x86_64 -cdrom $(ISO) -hda disk.img -vga vmware

clean:
	rm -rf $(ISO_DIR)
	rm -f $(ISO)
	rm -f boot/$(النواه)
	rm -rf $(BUILD)
